
# dev tools required for installed languages
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "curl"


brew "git"
brew "gpg"
brew "postgres"
brew "postgresql", restart_service: :changed
brew "vim"
brew "imagemagick"
brew "ripgrep"
brew "wget"

cask "iterm2"
cask "firefox"
cask "google-chrome"
cask "visual-studio-code"
cask "1password"
cask "vlc"
cask "slack"
cask "zoom"
cask "microsoft-teams"
cask "heroku-cli"
cask "rectangle"
cask "quicklook-json" 
cask "webpquicklook"
