
# dev tools required for installed languages
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "curl"
brew "cairo"
brew "pango"
brew "libpq"

brew "git"
brew "gpg"
# brew "postgres"
# brew "postgresql", restart_service: :changed
brew "vim"
brew "imagemagick"
brew "ffmpeg"
brew "ripgrep"
brew "wget"

cask "iterm2"
cask "firefox"
cask "google-chrome"
cask "visual-studio-code"
cask "1password"
cask "orbstack"
cask "obsidian"
cask "slack"
cask "zoom"
cask "microsoft-teams"
cask "gh"
cask "github"
cask "rectangle"
cask "quicklook-json"
cask "webpquicklook"
cask "unnaturalscrollwheels"

cask "font-fira-code"
cask "raycast"
